Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyIsCorruptError Property
 Some families have become unusable. Reload the families, or delete them from the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyIsCorruptError { get; }
Public Shared ReadOnly Property FamilyIsCorruptError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyIsCorruptError {
	FailureDefinitionId^ get ();
}
static member FamilyIsCorruptError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace